app/views/disciplines/index.html.haml

SELECT "disciplines".* FROM "disciplines"
---
        .toright
          - discipline.discipline_type.each do |dis_type|