app/views/groups/index.html.haml

      %tr
        %td= group.group_name
---
SELECT "groups".* FROM "groups"