app/views/users/index.html.haml

SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
          .toright
            - if !user.role_users.first.nil?
              %span.label.label-info
                = user.role_users.first.role.role_name
          .clearfix