app/views/community_users/index.html.haml

SELECT  "role_users".* FROM "role_users" WHERE "role_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        %td= community_user.user.last_name
        %td= community_user.user.first_name