app/views/community_users/show.html.haml

  = @community_user.user.last_name
  = @community_user.user.first_name
---
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]