app/controllers/communities_controller.rb

SELECT "communities".* FROM "communities"
---
  def index
    if @current_role_user.is_student? or @current_role_user.is_teacher?
      @communities = Community.check_access_to_community(@current_user_object.id)
    else
      @communities = Community.all

INSERT INTO "communities" ("community_name", "community_visibility", "archive", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["community_name", "Test1"], ["community_visibility", 0], ["archive", 0], ["created_at", 2017-02-15 15:41:01 UTC], ["updated_at", 2017-02-15 15:41:01 UTC]]
---
  def create
    @community = Community.new(community_params)
    #raise community_params.inspect
    respond_to do |format|
      if @community.save

SELECT  "communities".* FROM "communities" WHERE "communities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_community
      #community = Community.find(params[:id])
      @community = Community.includes(community_disciplines: {discipline: {discipline_sections: :marks}}, community_users: :user).find(params[:id])