app/controllers/community_users_controller.rb

  def index
    @community_users = CommunityUser.all
---
SELECT "community_users".* FROM "community_users"
SELECT "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1  [["user_id", 1]]

  def create
    @community_user = CommunityUser.new(community_user_params)

    respond_to do |format|
      if @community_user.save
---
INSERT INTO "community_users" ("link_type", "user_id", "community_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["link_type", 1], ["user_id", 4], ["community_id", 1], ["created_at", 2017-02-15 15:59:56 UTC], ["updated_at", 2017-02-15 15:59:56 UTC]]

    def set_community_user
      @community_user = CommunityUser.find(params[:id])
---
SELECT  "community_users".* FROM "community_users" WHERE "community_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]