app/controllers/disciplines_controller.rb

  def index
    @disciplines = Discipline.all.page(params[:page]).per(10)
---
SELECT "disciplines".* FROM "disciplines"