app/controllers/disciplines_api_controller.rb

INSERT INTO "disciplines" ("discipline_name", "discipline_type", "discipline_end", "term_id", "ranking_algorithm_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def load_from_json_file
    #sleep(10)
    if params.has_key?(:json_file)
      json = File.read(params[:json_file].path)
      json = JSON.parse(json)
      @results = Discipline.create_by_json(json)