app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups"
---
  def index
    @groups = Group.all

INSERT INTO "groups" ("group_name", "group_start", "archive_time", "term_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["group_name", "Б13-510"], ["group_start", Tue, 01 Nov 2016], ["archive_time", Sat, 31 Dec 2016], ["term_id", 1], ["created_at", 2016-12-26 05:16:02 UTC], ["updated_at", 2016-12-26 05:16:02 UTC]]
---
  def create
    @group = Group.new(group_params)

    respond_to do |format|
      if @group.save

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_group
      @group = Group.find(params[:id])