app/controllers/groups_api_controller.rb

  def load_from_json_file
    #sleep(10)
    if params.has_key?(:json_file)
      json = File.read(params[:json_file].path)
      json = JSON.parse(json)
      @results = Group.create_by_json(json)
---
INSERT INTO "groups" ("group_name", "group_start", "archive_time", "term_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["group_name", "C16-801"], ["group_start", Thu, 01 Sep 2016], ["archive_time", Tue, 31 Jan 2017], ["term_id", 1], ["created_at", 2016-12-26 08:26:39 UTC], ["updated_at", 2016-12-26 08:26:39 UTC]]