app/controllers/message_lists_controller.rb

SELECT "message_lists".* FROM "message_lists"
---
  def index
    @message_lists = MessageList.all.page(params[:page]).per(2)