app/controllers/ranking_algorithms_controller.rb

  def index
    @ranking_algorithms = RankingAlgorithm.all
---
SELECT "ranking_algorithms".* FROM "ranking_algorithms"