app/controllers/terms_controller.rb

SELECT "terms".* FROM "terms"
---
  def index
    @terms = Term.all

SELECT  "terms".* FROM "terms" WHERE "terms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_term
      @term = Term.find(params[:id])