app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users"

    def set_user
      @user = User.find(params[:id])
---
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]