app/controllers/welcome_controller.rb

SELECT  "role_users".* FROM "role_users" WHERE "role_users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def insufficient_privileges
    @current_user_object = current_user
    @current_user_login = @current_user_object.email
    @current_role_user = RoleUser.find(params['bad_user_role'])