app/views/message_lists/index.html.haml

          = ml.users.count
          /- if ml.users.count < 4
          .toright
---
SELECT  "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1 ORDER BY "role_users"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]