app/views/application/_navbar_top.html.haml

SELECT "role_users".* FROM "role_users" WHERE "role_users"."user_id" = $1  [["user_id", 1]]
---
            - unless @current_user_object.nil?
              - @current_user_object.role_users.each do |ru|